#+TITLE: Pyenv
#+author: Marco Antonio Cardoso Moreno

#+startup: CONTENT

** List all the available options
=pyenv install --list= will list all the available versions of python that can
be installed. We can pipe the output to =grep= so we can limit our search, as
shown below:
#+begin_src bash
pyenv install --list | grep " 3\.[678]"
#+end_src

#+RESULTS:
|   3.6.0 |
| 3.6-dev |
|   3.6.1 |
|   3.6.2 |
|   3.6.3 |
|   3.6.4 |
|   3.6.5 |
|   3.6.6 |
|   3.6.7 |
|   3.6.8 |
|   3.6.9 |
|  3.6.10 |
|  3.6.11 |
|  3.6.12 |
|  3.6.13 |
|  3.6.14 |
|   3.7.0 |
| 3.7-dev |
|   3.7.1 |
|   3.7.2 |
|   3.7.3 |
|   3.7.4 |
|   3.7.5 |
|   3.7.6 |
|   3.7.7 |
|   3.7.8 |
|   3.7.9 |
|  3.7.10 |
|  3.7.11 |
|   3.8.0 |
| 3.8-dev |
|   3.8.1 |
|   3.8.2 |
|   3.8.3 |
|   3.8.4 |
|   3.8.5 |
|   3.8.6 |
|   3.8.7 |
|   3.8.8 |
|   3.8.9 |
|  3.8.10 |
|  3.8.11 |
|  3.8.12 |

We can also install other builds, like =jython=, for example.
** see all installed versions
#+begin_src bash
pyenv versions
#+end_src

#+RESULTS:
| *                     | system | (set | by | /home/cardoso/.pyenv/version) |
| 3.6.7                 |        |      |    |                               |
| 3.6.7/envs/algorithms |        |      |    |                               |
| 3.6.7/envs/pygame     |        |      |    |                               |
| 3.8.5                 |        |      |    |                               |
| 3.8.5/envs/cip        |        |      |    |                               |
| algorithms            |        |      |    |                               |
| cip                   |        |      |    |                               |
| pygame                |        |      |    |                               |
the output of this command is a list of all python versions currently installed.
One of them will be marked with a =*=, which means that this version is /the
active version/.
